# Ejercicio de limpieza de datos

Ahora si, comencemos con la limpieza de datos:

In [2]:
#primero vamos a importar la librería que usaremos para este ejercicio
import pandas as pd
import warnings
warnings.simplefilter("ignore")

In [3]:
datos_raw=pd.read_json('/content/new_york_times_bestsellers-exercise.json')

ValueError: Expected object or value

Ya con nuestro data frame creado, vamos a realizar primeramente un pequeño análisis exploratorio

In [ ]:
#Démosle un primer vistazo a nuestra tabla de datos
datos_raw.head()

                                  amazon_product_url  ...  price
0  http://www.amazon.com/Robert-B-Parkers-Lullaby...  ...  26.95
1  http://www.amazon.com/Robert-B-Parkers-Lullaby...  ...  26.95
2  http://www.amazon.com/Robert-B-Parkers-Lullaby...  ...  26.95
3  http://www.amazon.com/Very-Valentine-Novel-Adr...  ...  25.99
4  http://www.amazon.com/Very-Valentine-Novel-Adr...  ...    NaN

[5 rows x 12 columns]

In [ ]:
#Ahora consultemos el tamaño de la tabla
datos_raw.shape

(2266, 12)

In [ ]:
#Las columnas de la tabla
datos_raw.columns

Index(['amazon_product_url', 'author', 'description', 'publisher', 'title',
       'oid', 'bestsellers_date', 'published_date.numberLong', 'rank',
       'rank_last_week', 'weeks_on_list', 'price'],
      dtype='object')

In [ ]:
#Los tipos de datos de cada columna
datos_raw.dtypes

amazon_product_url            object
author                        object
description                   object
publisher                     object
title                         object
oid                           object
bestsellers_date              object
published_date.numberLong     object
rank                          object
rank_last_week                 int64
weeks_on_list                  int64
price                        float64
dtype: object

Algo bastante útil que se puede hacer en este punto es seleccionar las columnas que queremos utilizar para nuestro proyecto.

In [ ]:
#Veamos en este ejemplo una tabla en la que me interesa tener los autores de los libros, el título del libro, su ranking y su precio
df = datos_raw[['author','title','rank','price']]
df.head()

             author                       title rank  price
0        Ace Atkins  ROBERT B. PARKER’S LULLABY    6  26.95
1        Ace Atkins  ROBERT B. PARKER’S LULLABY   12  26.95
2        Ace Atkins  ROBERT B. PARKER’S LULLABY   16  26.95
3  Adriana Trigiani              VERY VALENTINE    9  25.99
4  Adriana Trigiani              VERY VALENTINE   10    NaN

en el indice 4 hay un valor NAN asi que contemos los valores nan de cada columna, con el siguiente codigo

In [ ]:
df.isna().sum(axis=0)

author      0
title       0
rank        0
price     202
dtype: int64

Eliminación de los valores NAN

In [ ]:
df_drop=df.dropna(axis=0,how='any')

In [ ]:
df_drop.isna().sum(axis=0)

author    0
title     0
rank      0
price     0
dtype: int64

In [ ]:
df_drop.head()

             author                       title rank  price
0        Ace Atkins  ROBERT B. PARKER’S LULLABY    6  26.95
1        Ace Atkins  ROBERT B. PARKER’S LULLABY   12  26.95
2        Ace Atkins  ROBERT B. PARKER’S LULLABY   16  26.95
3  Adriana Trigiani              VERY VALENTINE    9  25.99
6  Adriana Trigiani            BRAVA, VALENTINE    7  25.99

otra forma de tratar los valores NAN es Reemplazarlos con la media:

In [ ]:
df['price'].mean()

26.75029069767371

In [ ]:
df['price']=df['price'].fillna(df['price'].mean())

In [ ]:
df.head()

             author                       title rank      price
0        Ace Atkins  ROBERT B. PARKER’S LULLABY    6  26.950000
1        Ace Atkins  ROBERT B. PARKER’S LULLABY   12  26.950000
2        Ace Atkins  ROBERT B. PARKER’S LULLABY   16  26.950000
3  Adriana Trigiani              VERY VALENTINE    9  25.990000
4  Adriana Trigiani              VERY VALENTINE   10  26.750291

Ahora hagamos un pequeño cálculo con nuestra tabla preparada:

In [ ]:
df_group=df.groupby('author')['price'].agg(['mean'])
df_group.head()

                       mean
author
Ace Atkins        26.950000
Adriana Trigiani  26.660097
Aimee Bender      25.950000
Albert Brooks     26.243430
Alex Berenson     26.583382

In [ ]:
df_sort=df_group.sort_values(by=['mean'],ascending=False)
df_sort.head(5)

                      mean
author
Haruki Murakami  30.083366
Neal Stephenson  29.950000
Pat Conroy       29.950000
Dan Brown        29.618996
Wally Lamb       29.416715